//网格大小NxM,入口x1 y1出口x2 y2
//1为道路 0为障碍
//求最短路径
//应该是bfs，从一个点出发，四个方向搜索，直到找到出口
//如果找到出口，记录路径长度，如果比之前的路径长度短，更新路径长度
//如果路径长度比之前的长，返回上一步
//如果四个方向都没有找到出口，返回上一步
#include <bits/stdc++.h>
using namespace std;
int dfs(int x1,int y1,int x2,int y2){
    //先判断如果入口就是出口那么直接返回1
    if(x1==x2&&y1==y2){
        return 1;
    }else
    {
    }
}
int main()
{
    int n=5,m=5;
    int x1=1,y1=1,x2=5,y2=5;
    int a[5][5]={{1,0,1,1,0},
               {1,1,0,1,1},
               {0,1,0,1,1},
               {1,1,1,1,1},
               {1,0,0,0,1}};
  return 0;
}