#include <iostream>
using namespace std;
//生成的数字中含有2 0 1 9即可，数字小于9999
//四层循环，只要有一层满足等于2 0 1 9 就可以
int main(){
    int n,n1,n2,n3,n4;
    n=40;
    if(n>=10&&n<100){
        for(int i=1;i<n;i++){
            n1=i%10;
            n2=i/10;
            cout<<n1<<" "<<n2;
        }
    }
    else if (n>=100&&n<=1000)
    {
        for(int i=1;i<n;i++){ //123
            n1=n%10; //123%10 = 3
            n2=(n/10)%10;//123/10=12
            n3=n/100;//123/100=1
        }
    }
    else if (n>=1000&&n<10000)
    {
        for(int i=1;i<n;i++){
            n1=n%10; //1234%10 = 4
            n2=(n/10)%10;//1234/10=123 123%10=3
            n3=(n/100)%10;//1234/100=12 12%10=2
            n4=n/1000;
        }
    }
    
    
}